Revit 2024 API
BoundingBoxUV.Bounds Property
Indexed access for loops. Use 0 for Min and 1 for Max.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public UV this[
	int idx
] { get; }
Visual Basic
Public ReadOnly Property Bounds ( _
	idx As Integer _
) As UV
	Get
Visual C++
public:
property UV^ Bounds[int idx] {
	UV^ get (int idx);
}
Parameters
idx
Type: System.Int32
See Also
BoundingBoxUV Class
Autodesk.Revit.DB Namespace